/*---------------------【程序设计】------------
功能：e=1+1/1!+1/2!+1/3!+......+1/n!
编写程序求无理数e的值,当子项的值<q时结束计算并返回。
测试数据:  当 (1/n!) < 0.000001 时 e=2.7182815256。
q由主函数传入
0.0001
e=2.7182539683

0.00001
e=2.7182787698

0.000001
e=2.7182815256

0.0001
e=2.718254


0.00001
e=2.718279

0.000001
e=2.718282

------------------------------*/
#include <stdio.h>
double fun(double q){

  /********** begin **********/
  double e=1;
  double jc=1;
  int i=1;
  while(1/jc>=q)
  {
  	e=e+1/jc;
  	i++;
  	jc*=i;
  }
  return e;
  /********** end **********/
}
int main(){

	double q;
	
	scanf("%lf", &q);
	
   printf("e=%.10lf\n", fun(q));
   
	return 0;  
}     


