/*
输入：28        输出：1 4 6 9 11 25 28 31 46 83 100
输入：0          输出：0 1 4 6 9 11 25 31 46 83 100
输入：120      输出：1 4 6 9 11 25 31 46 83 100 120
*/
#include <stdio.h>
// 定义main函数
int main()
{
    // 请在此添加代码
    /********** Begin *********/
    int  a[11]={1,4,6,9,11,25,31,46,83,100},i,j;
    int n,loc;
    scanf("%d",&n);
    for(i=0;i<10;i++)
    {
    	if(n<a[i])
    	{
    		//printf("插入点为：%d\n",i);
    		loc=i;
    		break;
		}
	}	
	for(j=10;j>loc;j--)
	{
		a[j]=a[j-1];
	}
	a[loc]=n;
	for(i=0;i<11;i++)
	{
		printf("%d\t",a[i]);
	 } 
    
    /********** End **********/
    return 0;
}

